Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ06GS001.h
extern volatile STRIG4BITS STRIG4bits __attribute__((__sfr__));

#define PWMCAP4 PWMCAP4
extern volatile unsigned int  PWMCAP4 __attribute__((__sfr__));
#define LEBCON4 LEBCON4
extern volatile unsigned int  LEBCON4 __attribute__((__sfr__));
__extension__ typedef struct tagLEBCON4BITS {
  union {
    struct {
      unsigned :3;
      unsigned LEB:7;
      unsigned CLLEBEN:1;
      unsigned FLTLEBEN:1;
      unsigned PLF:1;
      unsigned PLR:1;
      unsigned PHF:1;
      unsigned PHR:1;
    };
    struct {
      unsigned :3;
      unsigned LEB0:1;
      unsigned LEB1:1;
      unsigned LEB2:1;
      unsigned LEB3:1;
      unsigned LEB4:1;
      unsigned LEB5:1;
      unsigned LEB6:1;
    };
  };
} LEBCON4BITS;
extern volatile LEBCON4BITS LEBCON4bits __attribute__((__sfr__));

#define AUXCON4 AUXCON4
extern volatile unsigned int  AUXCON4 __attribute__((__sfr__));
typedef struct tagAUXCON4BITS {
  unsigned CHOPLEN:1;
  unsigned CHOPHEN:1;
  unsigned CHOPSEL:4;
  unsigned :8;
  unsigned HRDDIS:1;
  unsigned HRPDIS:1;
} AUXCON4BITS;
extern volatile AUXCON4BITS AUXCON4bits __attribute__((__sfr__));

#define CMPCON1 CMPCON1
extern volatile unsigned int  CMPCON1 __attribute__((__sfr__));
typedef struct tagCMPCON1BITS {
  unsigned RANGE:1;
  unsigned CMPPOL:1;
  unsigned HGAIN:1;
  unsigned CMPSTAT:1;
  unsigned HYSPOL:1;
  unsigned EXTREF:1;
  unsigned INSEL:2;
  unsigned DACOE:1;
  unsigned FCLKSEL:1;
  unsigned FLTREN:1;
  unsigned HYSSEL:2;
  unsigned CMPSIDL:1;
  unsigned :1;
  unsigned CMPON:1;
} CMPCON1BITS;
extern volatile CMPCON1BITS CMPCON1bits __attribute__((__sfr__));

#define CMPDAC1 CMPDAC1
extern volatile unsigned int  CMPDAC1 __attribute__((__sfr__));
typedef struct tagCMPDAC1BITS {
  unsigned CMREF:10;
} CMPDAC1BITS;
extern volatile CMPDAC1BITS CMPDAC1bits __attribute__((__sfr__));

#define CMPCON2 CMPCON2
extern volatile unsigned int  CMPCON2 __attribute__((__sfr__));
typedef struct tagCMPCON2BITS {
  unsigned RANGE:1;
  unsigned CMPPOL:1;
  unsigned HGAIN:1;
  unsigned CMPSTAT:1;
  unsigned HYSPOL:1;
  unsigned EXTREF:1;
  unsigned INSEL:2;
  unsigned DACOE:1;
  unsigned FCLKSEL:1;
  unsigned FLTREN:1;
  unsigned HYSSEL:2;
  unsigned CMPSIDL:1;
  unsigned :1;
  unsigned CMPON:1;
} CMPCON2BITS;
extern volatile CMPCON2BITS CMPCON2bits __attribute__((__sfr__));

#define CMPDAC2 CMPDAC2
extern volatile unsigned int  CMPDAC2 __attribute__((__sfr__));
typedef struct tagCMPDAC2BITS {
  unsigned CMREF:10;
} CMPDAC2BITS;
extern volatile CMPDAC2BITS CMPDAC2bits __attribute__((__sfr__));

#define RPINR0 RPINR0
extern volatile unsigned int  RPINR0 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR0BITS {
  union {
    struct {
      unsigned :8;
      unsigned INT1R:6;
    };
    struct {
      unsigned :8;
      unsigned INT1R0:1;
      unsigned INT1R1:1;
      unsigned INT1R2:1;
      unsigned INT1R3:1;
      unsigned INT1R4:1;
      unsigned INT1R5:1;
    };
  };
} RPINR0BITS;
extern volatile RPINR0BITS RPINR0bits __attribute__((__sfr__));

#define RPINR1 RPINR1
extern volatile unsigned int  RPINR1 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR1BITS {
  union {
    struct {
      unsigned INT2R:6;
    };
    struct {
      unsigned INT2R0:1;
      unsigned INT2R1:1;
      unsigned INT2R2:1;
      unsigned INT2R3:1;
      unsigned INT2R4:1;
      unsigned INT2R5:1;
    };
  };
} RPINR1BITS;
extern volatile RPINR1BITS RPINR1bits __attribute__((__sfr__));

#define RPINR2 RPINR2
extern volatile unsigned int  RPINR2 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR2BITS {
  union {
    struct {
      unsigned :8;
      unsigned T1CKR:6;
    };
    struct {
      unsigned :8;
      unsigned T1CKR0:1;
      unsigned T1CKR1:1;
      unsigned T1CKR2:1;
      unsigned T1CKR3:1;
      unsigned T1CKR4:1;
      unsigned T1CKR5:1;
    };
  };
} RPINR2BITS;
extern volatile RPINR2BITS RPINR2bits __attribute__((__sfr__));

#define RPINR3 RPINR3
extern volatile unsigned int  RPINR3 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR3BITS {
  union {
    struct {
      unsigned T2CKR:6;
    };
    struct {
      unsigned T2CKR0:1;
      unsigned T2CKR1:1;
      unsigned T2CKR2:1;
      unsigned T2CKR3:1;
      unsigned T2CKR4:1;
      unsigned T2CKR5:1;
    };
  };
} RPINR3BITS;
extern volatile RPINR3BITS RPINR3bits __attribute__((__sfr__));

#define RPINR29 RPINR29
extern volatile unsigned int  RPINR29 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR29BITS {
  union {
    struct {
      unsigned :8;
      unsigned FLT1R:6;
    };
    struct {
      unsigned :8;
      unsigned FLT1R0:1;
      unsigned FLT1R1:1;
      unsigned FLT1R2:1;
      unsigned FLT1R3:1;
      unsigned FLT1R4:1;
      unsigned FLT1R5:1;
    };
  };
} RPINR29BITS;
extern volatile RPINR29BITS RPINR29bits __attribute__((__sfr__));

#define RPINR30 RPINR30
extern volatile unsigned int  RPINR30 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR30BITS {
  union {
    struct {
      unsigned FLT2R:6;
      unsigned :2;
      unsigned FLT3R:6;
    };
    struct {
      unsigned FLT2R0:1;
      unsigned FLT2R1:1;
      unsigned FLT2R2:1;
      unsigned FLT2R3:1;
      unsigned FLT2R4:1;
      unsigned FLT2R5:1;
      unsigned :2;
      unsigned FLT3R0:1;
      unsigned FLT3R1:1;
      unsigned FLT3R2:1;
      unsigned FLT3R3:1;
      unsigned FLT3R4:1;
      unsigned FLT3R5:1;
    };
  };
} RPINR30BITS;
extern volatile RPINR30BITS RPINR30bits __attribute__((__sfr__));

#define RPINR31 RPINR31
extern volatile unsigned int  RPINR31 __attribute__((__sfr__));
__extension__ typedef struct tagRPINR31BITS {
  union {
    struct {
      unsigned FLT4R:6;
      unsigned :2;
      unsigned FLT5R:6;
    };
    struct {
      unsigned FLT4R0:1;
      unsigned FLT4R1:1;
      unsigned FLT4R2:1;
      unsigned FLT4R3:1;
      unsigned FLT4R4:1;
      unsigned FLT4R5:1;
      unsigned :2;
      unsigned FLT5R0:1;
      unsigned FLT5R1:1;
      unsigned FLT5R2:1;
      unsigned FLT5R3:1;
      unsigned FLT5R4:1;
      unsigned FLT5R5:1;
    };
  };
} RPINR31BITS;
extern volatile RPINR31BITS RPINR31bits __attribute__((__sfr__));

